Revit 2027 API
ExportFontInfo(String) Constructor
 Constructs a new ExportFontInfo using the destination font name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontInfo(
	string destinationFontName
)
Public Sub New (
	destinationFontName As String
)
public:
ExportFontInfo(
	String^ destinationFontName
)
new :
        destinationFontName : string -> ExportFontInfo
Parameters
destinationFontName String
 The destination font name (the name of the font in the exported format).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontInfo Class
ExportFontInfo Overload
Autodesk.Revit.DB Namespace